
// Вычислить значение арифметической формулы, используя обратную польскую запись.
// Создать обратную польскую запись для логической формулы.
// Вычислить значение логической формулы, используя обратную польскую запись.
// Создать обратную польскую запись для условного оператора.
// Создать обратную польскую запись для оператора цикла.
// Преобразовать трёхмерный массив в одномерный. Реализовать обращение к нему как трёхмерному, используя обратную польскую запись.
// Перечислить пути в ациклическом графе между двумя заданными вершинами.
// Выполнить топографическую сортировать ациклического графа
// *Перечислить пути в неориентированном графе между двумя заданными вершинами. Использовать простые пути.
// Преобразовать недетерминированный автомат в детерминированный.



void main(void)
{
	return 0;
}

// Десятичное число, представленное списком десятичных цифр, представить десятичным числом.
// long * output - указатель, куда надо поместить результат
// Возвращает: код ошибки. 0 - нет ошибок. 1 - на входе пустая строка.
int z1(double * output)
{
	char * input = getStr();
	{
		size_t length = strlen(input);
		if(length < 1) return 1;
		if(*input == '-') *ouput = -1;
		for(size_t i = 0; i < length)
		{
			
		}
		
	}
	free(input);
}

// Создать обратную польскую запись для арифметической формулы.

